# Basic Metrics

When we think about summarizing data, what are the metrics that we look at?

In this notebook, we will look in the price of weed dataset along with the demographic information of the United States. 

To read how the data was acquired, please read [this](https://github.com/amitkaps/weed/blob/master/1-Acquire.ipynb) to get more information

This notebook will make use of pandas quite a bit.

In [1]:
import numpy as np
import pandas as pd
from datetime import datetime as dt
from scipy import stats

### Read the input datasets. There are three datasets:

1. Weed price by date / state
2. Demographics of State
3. Population of state

In [2]:
prices_pd = pd.read_csv("../data/Weed_Price.csv", parse_dates=[-1])
demography_pd = pd.read_csv("../data/Demographics_State.csv")
population_pd = pd.read_csv("../data/Population_State.csv")

In [3]:
prices_pd.head()

        State   HighQ  HighQN    MedQ  MedQN    LowQ  LowQN       date
0     Alabama  339.06    1042  198.64    933  149.49    123 2014-01-01
1      Alaska  288.75     252  260.60    297  388.58     26 2014-01-01
2     Arizona  303.31    1941  209.35   1625  189.45    222 2014-01-01
3    Arkansas  361.85     576  185.62    544  125.87    112 2014-01-01
4  California  248.78   12096  193.56  12812  192.92    778 2014-01-01

In [4]:
prices_pd.tail()

               State   HighQ  HighQN    MedQ  MedQN  LowQ  LowQN       date
22894       Virginia  364.98    3513  293.12   3079   NaN    284 2014-12-31
22895     Washington  233.05    3337  189.92   3562   NaN    160 2014-12-31
22896  West Virginia  359.35     551  224.03    545   NaN     60 2014-12-31
22897      Wisconsin  350.52    2244  272.71   2221   NaN    167 2014-12-31
22898        Wyoming  322.27     131  351.86    197   NaN     12 2014-12-31

In [5]:
demography_pd.head()

,region,total_population,percent_white,percent_black,percent_asian,percent_hispanic,per_capita_income,median_rent,median_age
0,alabama,4799277,67,26,1,4,23680,501,38.1
1,alaska,720316,63,3,5,6,32651,978,33.6
2,arizona,6479703,57,4,3,30,25358,747,36.3
3,arkansas,2933369,74,15,1,7,22170,480,37.5
4,california,37659181,40,6,13,38,29527,1119,35.4

In [6]:
population_pd.head()

       region     value
0     alabama   4777326
1      alaska    711139
2     arizona   6410979
3    arkansas   2916372
4  california  37325068

In [12]:
prices_pd.dtypes
# prices_pd.info()
# prices_pd.columns
# prices_pd.index

State             object
HighQ            float64
HighQN             int64
MedQ             float64
MedQN              int64
LowQ             float64
LowQN              int64
date      datetime64[ns]
dtype: object

#### Sort the data on state and date, then fill NA values

In [18]:
prices_pd.sort_values(['State', 'date'], inplace=True)
prices_pd.fillna(method='ffill', inplace=True)

In [ ]:
prices_pd.sort(columns=['State', 'date'], inplace=True)
prices_pd.fillna(method='ffill', inplace=True)

### Finding mean, median, mode, variance, standard deviation for California

#### Mean

arithmetic average of a range of values or quantities, computed by dividing the total of all values by the number of values.

In [19]:
prices_pd.head()

         State   HighQ  HighQN    MedQ  MedQN    LowQ  LowQN       date
20094  Alabama  339.65    1033  198.04    926  147.15    122 2013-12-27
20859  Alabama  339.65    1033  198.04    926  147.15    122 2013-12-28
21573  Alabama  339.75    1036  198.26    929  149.49    123 2013-12-29
22287  Alabama  339.75    1036  198.81    930  149.49    123 2013-12-30
22797  Alabama  339.42    1040  198.68    932  149.49    123 2013-12-31

In [26]:
prices_california_pd = prices_pd[prices_pd['State'] == 'California'].copy(True)
prices_california_pd.head()

            State   HighQ  HighQN    MedQ  MedQN    LowQ  LowQN       date
20098  California  248.77   12021  193.44  12724  193.88    770 2013-12-27
20863  California  248.74   12025  193.44  12728  193.88    770 2013-12-28
21577  California  248.76   12047  193.55  12760  193.60    772 2013-12-29
22291  California  248.82   12065  193.54  12779  193.80    773 2013-12-30
22801  California  248.76   12082  193.54  12792  193.80    773 2013-12-31

In [35]:
ca_hq_sum = prices_california_pd['HighQ'].sum() 
ca_hq_sum

110173.88

In [38]:
ca_hq_count = prices_california_pd['HighQ'].count()
ca_hq_count

449

In [40]:
ca_hq_mean = ca_hq_sum / ca_hq_count
print("Mean weed price in CA is:", ca_hq_mean)

Mean weed price in CA is: 245.37612472160356

In [9]:
california_pd = prices_pd[prices_pd.State == "California"].copy(True)
california_pd.head()

            State   HighQ  HighQN    MedQ  MedQN    LowQ  LowQN       date
20098  California  248.77   12021  193.44  12724  193.88    770 2013-12-27
20863  California  248.74   12025  193.44  12728  193.88    770 2013-12-28
21577  California  248.76   12047  193.55  12760  193.60    772 2013-12-29
22291  California  248.82   12065  193.54  12779  193.80    773 2013-12-30
22801  California  248.76   12082  193.54  12792  193.80    773 2013-12-31

In [10]:
ca_sum = california_pd['HighQ'].sum()

In [11]:
ca_count = california_pd['HighQ'].count()

In [12]:
ca_mean = ca_sum / ca_count
print "Mean weed price in CA is:", ca_mean

Mean weed price in CA is: 245.376124722

#### Exercise: Find CA mean for 2013, 2014 & 2015 separately

*Hint:* `california_pd.iloc[0]['date'].year`

In [42]:
prices_california_pd.head()

            State   HighQ  HighQN    MedQ  MedQN    LowQ  LowQN       date
20098  California  248.77   12021  193.44  12724  193.88    770 2013-12-27
20863  California  248.74   12025  193.44  12728  193.88    770 2013-12-28
21577  California  248.76   12047  193.55  12760  193.60    772 2013-12-29
22291  California  248.82   12065  193.54  12779  193.80    773 2013-12-30
22801  California  248.76   12082  193.54  12792  193.80    773 2013-12-31

In [45]:
prices_california_pd['year'] = prices_california_pd['date'].dt.year
prices_california_pd.head()

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

,State,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,date,year
20098,California,248.77,12021,193.44,12724,193.88,770,2013-12-27,2013
20863,California,248.74,12025,193.44,12728,193.88,770,2013-12-28,2013
21577,California,248.76,12047,193.55,12760,193.60,772,2013-12-29,2013
22291,California,248.82,12065,193.54,12779,193.80,773,2013-12-30,2013
22801,California,248.76,12082,193.54,12792,193.80,773,2013-12-31,2013

In [52]:
ca_year_sum = prices_california_pd.groupby('year').sum()
ca_year_sum

         HighQ   HighQN      MedQ    MedQN      LowQ   LowQN
year
2013   1243.85    60240    967.51    63783    968.96    3858
2014  89505.50  5255600  69812.74  5822402  69155.87  341570
2015  19424.53  1395396  15099.49  1643465  15088.00   92930

In [49]:
ca_year_count = prices_california_pd.groupby('year').count()
ca_year_count

      State  HighQ  HighQN  MedQ  MedQN  LowQ  LowQN  date
year
2013      5      5       5     5      5     5      5     5
2014    364    364     364   364    364   364    364   364
2015     80     80      80    80     80    80     80    80

In [53]:
ca_hq_2013_mean = ca_year_sum.loc[2013, 'HighQ'] / ca_year_count.loc[2013, 'HighQ']
ca_hq_2013_mean

248.76999999999998

In [54]:
ca_hq_2014_mean = ca_year_sum.loc[2014, 'HighQ'] / ca_year_count.loc[2014, 'HighQ']
ca_hq_2014_mean

245.8942307692308

In [55]:
ca_hq_2015_mean = ca_year_sum.loc[2015, 'HighQ'] / ca_year_count.loc[2015, 'HighQ']
ca_hq_2015_mean

242.80662499999994

#### Median

Denotes value or quantity lying at the midpoint of a frequency distribution of observed values or quantities, such that there is an equal probability of falling above or below it. Simply put, it is the *middle* value in the list of numbers.

In [56]:
prices_california_pd.head()

,State,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,date,year
20098,California,248.77,12021,193.44,12724,193.88,770,2013-12-27,2013
20863,California,248.74,12025,193.44,12728,193.88,770,2013-12-28,2013
21577,California,248.76,12047,193.55,12760,193.60,772,2013-12-29,2013
22291,California,248.82,12065,193.54,12779,193.80,773,2013-12-30,2013
22801,California,248.76,12082,193.54,12792,193.80,773,2013-12-31,2013

In [57]:
ca_count

449

In [76]:
ca_hq_series = prices_california_pd.sort_values(['HighQ'])['HighQ'].copy(True)
ca_hq_series.head()

19027    241.84
19741    241.85
8011     241.87
8827     241.87
18313    241.88
Name: HighQ, dtype: float64

In [70]:
ca_hq_median_index = int(ca_count/2)
ca_hq_median_index

224

In [77]:
ca_hq_median = ca_hq_series.iloc[ca_hq_median_index]
print("Median price of weed in CA is:", ca_hq_median)

Median price of weed in CA is: 245.31

In [13]:
ca_count

449

If count is odd, the median is the value at (n+1)/2,

else it is the average of n/2 and (n+1)/2

In [ ]:
ca_highq_pd = california_pd.sort(columns=['HighQ'])
ca_highq_pd.head()

In [15]:
ca_median = ca_highq_pd.HighQ.iloc[(ca_count) / 2]
print("Median price of weed in CA is:", ca_median)

Median price of weed in CA is: 245.31

#### Mode

It is the number which appears most often in a set of numbers.

In [78]:
prices_california_pd.head()

,State,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,date,year
20098,California,248.77,12021,193.44,12724,193.88,770,2013-12-27,2013
20863,California,248.74,12025,193.44,12728,193.88,770,2013-12-28,2013
21577,California,248.76,12047,193.55,12760,193.60,772,2013-12-29,2013
22291,California,248.82,12065,193.54,12779,193.80,773,2013-12-30,2013
22801,California,248.76,12082,193.54,12792,193.80,773,2013-12-31,2013

In [96]:
ca_hq_mode = prices_california_pd['HighQ'].value_counts().index[0]
ca_hq_mode

245.05

In [97]:
print("The most common price is CA, as indicated by its mode, is:", ca_hq_mode)

The most common price is CA, as indicated by its mode, is: 245.05

In [16]:
ca_mode = ca_highq_pd.HighQ.value_counts().index[0]
print("The most common price is CA, as indicated by its mode, is:", ca_mode)

The most common price is CA, as indicated by its mode, is: 245.05

#### Variance

> Once two statistician of height 4 feet and 5 feet have to cross a river of AVERAGE depth 3 feet. Meanwhile, a third person comes and said, "what are you waiting for? You can easily cross the river"

It's the average distance of the data values from the *mean*

<img style="float: left;" src="img/variance.png" height="320" width="320">

In [98]:
ca_hq_mean

245.37612472160356

In [99]:
ca_count

449

In [100]:
prices_california_pd.head()

,State,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,date,year
20098,California,248.77,12021,193.44,12724,193.88,770,2013-12-27,2013
20863,California,248.74,12025,193.44,12728,193.88,770,2013-12-28,2013
21577,California,248.76,12047,193.55,12760,193.60,772,2013-12-29,2013
22291,California,248.82,12065,193.54,12779,193.80,773,2013-12-30,2013
22801,California,248.76,12082,193.54,12792,193.80,773,2013-12-31,2013

In [115]:
prices_california_pd['HighQ_Variance'] = prices_california_pd['HighQ'].apply(lambda x: np.square(x - ca_hq_mean))
prices_california_pd.head()

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

,State,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,date,year,HQ_Variance,HighQ_Variance
20098,California,248.77,12021,193.44,12724,193.88,770,2013-12-27,2013,11.518389,11.518389
20863,California,248.74,12025,193.44,12728,193.88,770,2013-12-28,2013,11.315657,11.315657
21577,California,248.76,12047,193.55,12760,193.60,772,2013-12-29,2013,11.450612,11.450612
22291,California,248.82,12065,193.54,12779,193.80,773,2013-12-30,2013,11.860277,11.860277
22801,California,248.76,12082,193.54,12792,193.80,773,2013-12-31,2013,11.450612,11.450612

In [117]:
ca_hq_variance = prices_california_pd['HighQ_Variance'].sum() / (ca_count - 1)
ca_hq_variance

2.982686287981228

In [118]:
print("Variance of High Quality weed prices in CA is:", ca_hq_variance)

Variance of High Quality weed prices in CA is: 2.982686287981228

In [17]:
california_pd['HighQ_dev'] = (california_pd['HighQ'] - ca_mean) ** 2

In [18]:
ca_HighQ_variance = california_pd.HighQ_dev.sum() / (ca_count - 1)
print("Variance of High Quality weed prices in CA is:", ca_HighQ_variance)

Variance of High Quality weed prices in CA is: 2.98268628798

#### Standard Deviation

It is the square root of variance. This will have the same units as the data and mean.

In [119]:
ca_hq_std = np.sqrt(ca_hq_variance)
ca_hq_std

1.727045537321245

In [120]:
print("Standard Deviation of High Quality weed prices in CA is:", ca_hq_std)

Standard Deviation of High Quality weed prices in CA is: 1.727045537321245

In [19]:
ca_HighQ_SD = np.sqrt(ca_HighQ_variance)
print("Standard Deviation of High Quality weed prices in CA is:", ca_HighQ_SD)

Standard Deviation of High Quality weed prices in CA is: 1.72704553732

#### Using Pandas built-in function

In [20]:
california_pd.describe()

,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,HighQ_dev
count,449.000000,449.000000,449.000000,449.000000,449.000000,449.000000,449.000000
mean,245.376125,14947.073497,191.268909,16769.821826,189.783586,976.298441,2.976043
std,1.727046,1656.133565,1.524028,2433.943191,1.598252,120.246714,3.961134
min,241.840000,12021.000000,187.850000,12724.000000,187.830000,770.000000,0.000015
25%,244.480000,13610.000000,190.260000,14826.000000,188.600000,878.000000,0.106357
50%,245.310000,15037.000000,191.570000,16793.000000,188.600000,982.000000,0.729103
75%,246.220000,16090.000000,192.550000,18435.000000,191.320000,1060.000000,4.435761
max,248.820000,18492.000000,193.630000,22027.000000,193.880000,1232.000000,12.504178

In [21]:
california_pd.HighQ.mode()

0    245.03
1    245.05
dtype: float64

#### Co-variance 

covariance as a measure of the (average) co-variation between two variables, say x and y. Covariance describes both how far the variables are spread out, and the nature of their relationship, Covariance is a measure of how much two variables change together. Compare this to Variance, which is just the range over which one measure (or variable) varies.

<img style="float: left;" src="img/covariance.png" height="270" width="270">

<br>
<br>
<br>
<br>

#### Co-variance of weed price in California vs New York

In [124]:
ny_pd = prices_pd[prices_pd['State'] == 'New York'].copy(True)
ny_pd.head()

          State   HighQ  HighQN    MedQ  MedQN    LowQ  LowQN       date
20120  New York  351.98    5773  268.83   5786  190.31    479 2013-12-27
20885  New York  351.92    5775  268.83   5786  190.31    479 2013-12-28
21599  New York  351.99    5785  269.02   5806  190.75    480 2013-12-29
22313  New York  352.02    5791  268.98   5814  190.75    480 2013-12-30
22823  New York  351.97    5794  268.93   5818  190.75    480 2013-12-31

In [125]:
ny_pd = ny_pd.iloc[:,[1,7]]
ny_pd.columns = ['NY_HighQ', 'date']

In [126]:
ny_pd.head()

       NY_HighQ       date
20120    351.98 2013-12-27
20885    351.92 2013-12-28
21599    351.99 2013-12-29
22313    352.02 2013-12-30
22823    351.97 2013-12-31

In [128]:
ca_ny_pd = pd.merge(prices_california_pd.iloc[:,[1,7]].copy(), ny_pd, on="date")
ca_ny_pd.rename(columns={"HighQ": "CA_HighQ"}, inplace=True)
ca_ny_pd.head()

   CA_HighQ       date  NY_HighQ
0    248.77 2013-12-27    351.98
1    248.74 2013-12-28    351.92
2    248.76 2013-12-29    351.99
3    248.82 2013-12-30    352.02
4    248.76 2013-12-31    351.97

In [129]:
ny_mean = ca_ny_pd.NY_HighQ.mean()
ny_mean

346.9127616926502

In [131]:
ca_ny_pd['ca_dev'] = ca_ny_pd['CA_HighQ'] - ca_hq_mean
ca_ny_pd.head()

   CA_HighQ       date  NY_HighQ    ca_dev
0    248.77 2013-12-27    351.98  3.393875
1    248.74 2013-12-28    351.92  3.363875
2    248.76 2013-12-29    351.99  3.383875
3    248.82 2013-12-30    352.02  3.443875
4    248.76 2013-12-31    351.97  3.383875

In [132]:
ca_ny_pd['ny_dev'] = ca_ny_pd['NY_HighQ'] - ny_mean
ca_ny_pd.head()

   CA_HighQ       date  NY_HighQ    ca_dev    ny_dev
0    248.77 2013-12-27    351.98  3.393875  5.067238
1    248.74 2013-12-28    351.92  3.363875  5.007238
2    248.76 2013-12-29    351.99  3.383875  5.077238
3    248.82 2013-12-30    352.02  3.443875  5.107238
4    248.76 2013-12-31    351.97  3.383875  5.057238

In [133]:
ca_ny_cov = (ca_ny_pd['ca_dev'] * ca_ny_pd['ny_dev']).sum() / (ca_count - 1)
print("Covariance of the High Quality weed prices in CA and NY is:", ca_ny_cov)

Covariance of the High Quality weed prices in CA and NY is: 5.91681496728842

#### Using Pandas built-in function

In [30]:
ca_ny_pd.cov()

          CA_HighQ   NY_HighQ    ca_dev     ny_dev
CA_HighQ  2.982686   5.916815  2.982686   5.916815
NY_HighQ  5.916815  12.245147  5.916815  12.245147
ca_dev    2.982686   5.916815  2.982686   5.916815
ny_dev    5.916815  12.245147  5.916815  12.245147

### Correlation

Extent to which two or more variables fluctuate together. A positive correlation indicates the extent to which those variables increase or decrease in parallel; a negative correlation indicates the extent to which one variable increases as the other decreases.

<img style="float: left;" src="img/correlation.gif" height="270" width="270">

<br>
<br>
<br>

#### Finding correlation between weed prices in New York and California

In [134]:
ca_highq_std = ca_ny_pd.CA_HighQ.std()
ny_highq_std = ca_ny_pd.NY_HighQ.std()

ca_ny_corr = ca_ny_cov / (ca_highq_std * ny_highq_std)
print("Correlation between weed prices in NY and CA:", ca_ny_corr)

Correlation between weed prices in NY and CA: 0.9790439611064712

In [135]:
ca_ny_pd.corr()

          CA_HighQ  NY_HighQ    ca_dev    ny_dev
CA_HighQ  1.000000  0.979044  1.000000  0.979044
NY_HighQ  0.979044  1.000000  0.979044  1.000000
ca_dev    1.000000  0.979044  1.000000  0.979044
ny_dev    0.979044  1.000000  0.979044  1.000000

# Correlation != Causation

correlation between two variables does not necessarily imply that one causes the other.


<img style="float: left;" src="img/correlation_not_causation.gif" height="570" width="570">